#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

data.scaleway_iam_application.kapsule: Reading...
scaleway_domain_zone.dev[0]: Refreshing state... [id=dev.dotstory.de]
module.k8s_cluster.scaleway_cockpit_token.grafana_alloy: Refreshing state... [id=fr-par/36356088-835d-4a3f-b1e5-d87348ad34d3]
module.k8s_cluster.scaleway_vpc_private_network.this: Refreshing state... [id=fr-par/dffb52b6-2a4c-4623-9044-8dc37c8949af]
module.rdb_databases["keycloak"].random_password.this: Refreshing state... [id=none]
data.scaleway_iam_application.strategytool: Reading...
module.k8s_deployments.random_password.keycloak: Refreshing state... [id=none]
module.rdb_databases["strategytool"].random_password.this: Refreshing state... [id=none]
scaleway_object_bucket.upload: Refreshing state... [id=fr-par/strategytool-upload]
module.k8s_deployments.random_password.auth_secret: Refreshing state... [id=none]
data.scaleway_domain_zone.root: Reading...
data.scaleway_iam_application.cert_manager: Reading...
data.scaleway_iam_application.strategytool: Read complete after 1s [id=fff61d3e-5eda-4feb-86fc-8e279f38f1b9]
data.scaleway_iam_application.kapsule: Read complete after 1s [id=48b5a810-07bc-40b0-b208-ceb70c9f96fc]
scaleway_iam_api_key.registry_password: Refreshing state... [id=SCWV1PBFXRG419GE6HQH]
scaleway_iam_api_key.strategytool: Refreshing state... [id=SCW5PS2PWRWZMZXE4N28]
data.scaleway_iam_application.cert_manager: Read complete after 1s [id=d6b54a86-4e7b-49ad-805f-a0d8ab2bb564]
data.scaleway_domain_zone.root: Read complete after 1s [id=.dotstory.de]
module.k8s_cluster.scaleway_k8s_cluster.this: Refreshing state... [id=fr-par/f636851c-96ef-414c-a39e-cd89c083f599]
scaleway_rdb_instance.dev: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4]
scaleway_iam_api_key.cert_manager: Refreshing state... [id=SCW2M0XRCQKMHXR9VJMC]
scaleway_domain_record.mail: Refreshing state... [id=ac8ad8b3-58a1-46f0-ae96-db72b078f6e6]
scaleway_tem_domain.this: Refreshing state... [id=fr-par/0d097f01-517e-4717-aa53-059b5dd8130c]
data.keycloak_openid_client.strategytool: Reading...
module.k8s_cluster.scaleway_k8s_pool.this: Refreshing state... [id=fr-par/dd4a13b6-94ae-4fb6-adea-6023d7acb93f]
scaleway_domain_record.dmarc: Refreshing state... [id=400bd24e-b8fe-4e64-bb61-28029b93953d]
scaleway_domain_record.dkim: Refreshing state... [id=d43ae056-f879-4601-b6e9-5c9a70d2961a]
scaleway_domain_record.spf: Refreshing state... [id=82244a99-9ad1-4acb-ac7f-ef1e3969f5cf]
data.keycloak_openid_client.strategytool: Read complete after 0s [id=899c22af-b2c6-4084-a1fe-26d2510386a2]
module.rdb_databases["strategytool"].scaleway_rdb_user.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/strategytool]
module.rdb_databases["keycloak"].data.scaleway_rdb_instance.this: Reading...
module.rdb_databases["keycloak"].scaleway_rdb_user.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/keycloak]
module.rdb_databases["strategytool"].data.scaleway_rdb_instance.this: Reading...
module.rdb_databases["keycloak"].scaleway_rdb_database.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/keycloak]
module.rdb_databases["strategytool"].scaleway_rdb_database.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/strategytool]
module.k8s_cluster.null_resource.kubeconfig: Refreshing state... [id=8389456854455782582]
module.k8s_deployments.kubernetes_ingress_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.kubernetes_service_v1.keycloak: Refreshing state... [id=default/keycloak]
module.k8s_deployments.kubernetes_role_binding_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.kubernetes_secret_v1.image_pull_secret: Refreshing state... [id=default/registry-credentials]
module.k8s_deployments.kubernetes_role_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.kubernetes_service_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.kubernetes_config_map.grafana_alloy: Refreshing state... [id=default/grafana-alloy]
module.rdb_databases["keycloak"].data.scaleway_rdb_instance.this: Read complete after 1s [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4]
module.k8s_deployments.kubernetes_secret_v1.keycloak: Refreshing state... [id=default/keycloak-credentials]
module.rdb_databases["strategytool"].data.scaleway_rdb_instance.this: Read complete after 1s [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4]
module.k8s_deployments.helm_release.traefik_ingress: Refreshing state... [id=traefik-ingress]
module.k8s_deployments.helm_release.grafana_alloy: Refreshing state... [id=grafana-alloy]
scaleway_object_bucket_acl.upload: Refreshing state... [id=fr-par/strategytool-upload/private]
module.k8s_deployments.helm_release.cert_manager[0]: Refreshing state... [id=cert-manager]
module.rdb_databases["strategytool"].scaleway_rdb_privilege.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/strategytool/strategytool]
module.rdb_databases["keycloak"].scaleway_rdb_privilege.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/keycloak/keycloak]
module.k8s_deployments.kubernetes_job_v1.migrate: Refreshing state... [id=default/migrate]
module.k8s_deployments.kubernetes_deployment_v1.keycloak: Refreshing state... [id=default/keycloak]
module.k8s_deployments.data.kubernetes_service_v1.traefik_ingress: Reading...
module.k8s_deployments.data.kubernetes_service_v1.traefik_ingress: Read complete after 0s [id=kube-system/traefik-ingress]
scaleway_domain_record.keycloak[0]: Refreshing state... [id=9b9c7973-9655-4544-96d8-9ee680b6a01f]
scaleway_domain_record.strategytool[0]: Refreshing state... [id=cf7c67e6-737f-4363-a533-3332b77bc743]
scaleway_domain_record.strategytool_wildcard[0]: Refreshing state... [id=aa1e985a-4a1e-45f0-8bd3-c82dd5b3376b]
module.k8s_deployments.kubernetes_deployment_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.helm_release.cert_manager_webhook[0]: Refreshing state... [id=scaleway-webhook]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # scaleway_tem_domain.this has been deleted
  - resource "scaleway_tem_domain" "this" {
      - dkim_config            = "v=DKIM1; h=sha256; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA36nbDl/QezByiW1qdJ59Q5Yc3286Bd4b2AmCXZVef28PwIkJa6M5jtZS4krAZC4cv2OJnKKVlPZbA6dDPzYDbwN30qKjo6txmrOTyAGmsgbfD+neiZf/FtAtNVaEgn7AsKtU6QjFBE8IDJj0G/eC37j7gIWXWAJKDEk67/Rdo6lL5ZnWQ3AsnXIO2r/h+hm4bAIx5TUY4QLsA3YcNe0LO+GBZdHE2R4uND6VgNvjQDmOIMLCZagKqMkIRHIkK7KEkgqJxrzj/5YpXFVRPPDeY5mF82QMGNPQpcES9HKqTYPT5FVTPM2QqkPHz/9RlBxAwsaxvG5dW+nIRzaN+n7+UQIDAQAB" -> null
      - dmarc_config           = "v=DMARC1; p=none; rua=mailto:3540cd60-b53f-459c-880b-48443c48c4db@dmarc.scw-tem.cloud; ruf=mailto:3540cd60-b53f-459c-880b-48443c48c4db@dmarc.scw-tem.cloud" -> null
      - dmarc_name             = "_dmarc" -> null
        id                     = "fr-par/0d097f01-517e-4717-aa53-059b5dd8130c"
        name                   = "dotstory.de"
      - project_id             = "41b5c043-ce43-4431-a671-8ce6774d61ff" -> null
      - spf_config             = "include:_spf.scw-tem.cloud" -> null
        # (17 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # scaleway_domain_record.dkim must be replaced
-/+ resource "scaleway_domain_record" "dkim" {
      ~ data            = "v=DKIM1; h=sha256; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA36nbDl/QezByiW1qdJ59Q5Yc3286Bd4b2AmCXZVef28PwIkJa6M5jtZS4krAZC4cv2OJnKKVlPZbA6dDPzYDbwN30qKjo6txmrOTyAGmsgbfD+neiZf/FtAtNVaEgn7AsKtU6QjFBE8IDJj0G/eC37j7gIWXWAJKDEk67/Rdo6lL5ZnWQ3AsnXIO2r/h+hm4bAIx5TUY4QLsA3YcNe0LO+GBZdHE2R4uND6VgNvjQDmOIMLCZagKqMkIRHIkK7KEkgqJxrzj/5YpXFVRPPDeY5mF82QMGNPQpcES9HKqTYPT5FVTPM2QqkPHz/9RlBxAwsaxvG5dW+nIRzaN+n7+UQIDAQAB" -> (known after apply)
      ~ fqdn            = "41b5c043-ce43-4431-a671-8ce6774d61ff._domainkey.dotstory.de" -> (known after apply)
      ~ id              = "d43ae056-f879-4601-b6e9-5c9a70d2961a" -> (known after apply)
      + keep_empty_zone = false
      ~ name            = "41b5c043-ce43-4431-a671-8ce6774d61ff._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ priority        = 0 -> (known after apply)
      ~ project_id      = "41b5c043-ce43-4431-a671-8ce6774d61ff" -> (known after apply)
      ~ root_zone       = true -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # scaleway_domain_record.dmarc must be replaced
-/+ resource "scaleway_domain_record" "dmarc" {
      ~ data            = "v=DMARC1; p=none; rua=mailto:3540cd60-b53f-459c-880b-48443c48c4db@dmarc.scw-tem.cloud; ruf=mailto:3540cd60-b53f-459c-880b-48443c48c4db@dmarc.scw-tem.cloud" -> (known after apply)
      ~ fqdn            = "_dmarc.dotstory.de" -> (known after apply)
      ~ id              = "400bd24e-b8fe-4e64-bb61-28029b93953d" -> (known after apply)
      ~ name            = "_dmarc" # forces replacement -> (known after apply) # forces replacement
      ~ priority        = 0 -> (known after apply)
      ~ project_id      = "41b5c043-ce43-4431-a671-8ce6774d61ff" -> (known after apply)
      ~ root_zone       = true -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # scaleway_domain_record.spf will be updated in-place
  ~ resource "scaleway_domain_record" "spf" {
      ~ data            = "v=spf1 include:_spf.scw-tem.cloud -all" -> (known after apply)
        id              = "82244a99-9ad1-4acb-ac7f-ef1e3969f5cf"
      + keep_empty_zone = false
        name            = null
        # (7 unchanged attributes hidden)
    }

  # scaleway_tem_domain.this will be created
  + resource "scaleway_tem_domain" "this" {
      + accept_tos             = true
      + created_at             = (known after apply)
      + dkim_config            = (known after apply)
      + dmarc_config           = (known after apply)
      + dmarc_name             = (known after apply)
      + id                     = (known after apply)
      + last_error             = (known after apply)
      + last_valid_at          = (known after apply)
      + mx_blackhole           = (known after apply)
      + name                   = "dotstory.de"
      + next_check_at          = (known after apply)
      + project_id             = (known after apply)
      + region                 = (known after apply)
      + reputation             = (known after apply)
      + revoked_at             = (known after apply)
      + smtp_host              = (known after apply)
      + smtp_port              = (known after apply)
      + smtp_port_alternative  = (known after apply)
      + smtp_port_unsecure     = (known after apply)
      + smtps_auth_user        = (known after apply)
      + smtps_port             = (known after apply)
      + smtps_port_alternative = (known after apply)
      + spf_config             = (known after apply)
      + status                 = (known after apply)
    }

  # module.k8s_deployments.kubectl_manifest.cluster_issuer[0] will be created
  + resource "kubectl_manifest" "cluster_issuer" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt
            spec:
              acme:
                email: daniel@knotdots.de
                privateKeySecretRef:
                  name: issuer-account-key
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - dns01:
                    webhook:
                      groupName: acme.scaleway.com
                      solverName: scaleway
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.k8s_deployments.kubectl_manifest.compress_middleware[0] will be created
  + resource "kubectl_manifest" "compress_middleware" {
      + api_version             = "traefik.containo.us/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Middleware"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "test-compress"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: traefik.containo.us/v1alpha1
            kind: Middleware
            metadata:
              name: test-compress
            spec:
              compress: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.k8s_deployments.kubernetes_deployment_v1.strategytool will be updated in-place
  ~ resource "kubernetes_deployment_v1" "strategytool" {
        id               = "default/strategytool"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                        name                       = "app"
                        # (10 unchanged attributes hidden)

                      ~ env {
                          ~ name  = "SCW_API_ACCESS_KEY" -> "OTEL_EXPORTER_OTLP_ENDPOINT"
                          ~ value = "SCW5PS2PWRWZMZXE4N28" -> "http://grafana-alloy.default.svc.cluster.local:4318"
                        }
                      ~ env {
                          ~ name  = "SCW_API_SECRET_KEY" -> "OTEL_SERVICE_NAME"
                          # Warning: this attribute value will no longer be marked as sensitive
                          # after applying this change.
                          ~ value = (sensitive value)
                        }
                      ~ env {
                          ~ name  = "SCW_BUCKET_NAME" -> "SCW_API_ACCESS_KEY"
                          ~ value = "strategytool-upload" -> "SCW5PS2PWRWZMZXE4N28"
                        }
                      ~ env {
                          ~ name  = "SCW_REGION" -> "SCW_API_SECRET_KEY"
                          # Warning: this attribute value will be marked as sensitive and will not
                          # display in UI output after applying this change.
                          ~ value = (sensitive value)
                        }
                      ~ env {
                          ~ name  = "KC_CLIENT_SECRET" -> "SCW_BUCKET_NAME"
                          # Warning: this attribute value will no longer be marked as sensitive
                          # after applying this change.
                          ~ value = (sensitive value)
                        }
                      ~ env {
                          ~ name  = "PGDATABASE" -> "SCW_REGION"
                          ~ value = "strategytool" -> "fr-par"
                        }
                      ~ env {
                          ~ name  = "PGHOST" -> "KC_CLIENT_SECRET"
                          # Warning: this attribute value will be marked as sensitive and will not
                          # display in UI output after applying this change.
                          ~ value = (sensitive value)
                        }
                      ~ env {
                          ~ name  = "PGPASSWORD" -> "PGDATABASE"
                          # Warning: this attribute value will no longer be marked as sensitive
                          # after applying this change.
                          ~ value = (sensitive value)
                        }
                      ~ env {
                          ~ name  = "PGPORT" -> "PGHOST"
                          ~ value = "5432" -> "172.16.12.4"
                        }
                      ~ env {
                          ~ name  = "PGUSER" -> "PGPASSWORD"
                          # Warning: this attribute value will be marked as sensitive and will not
                          # display in UI output after applying this change.
                          ~ value = (sensitive value)
                        }
                      ~ env {
                          ~ name  = "PUBLIC_BASE_URL" -> "PGPORT"
                          ~ value = "https://strategytool.dev.dotstory.de" -> "5432"
                        }
                      ~ env {
                          ~ name  = "PUBLIC_KC_CLIENT_ID" -> "PGUSER"
                            # (1 unchanged attribute hidden)
                        }
                      ~ env {
                          ~ name  = "PUBLIC_KC_REALM" -> "PUBLIC_BASE_URL"
                          ~ value = "knot-dots" -> "https://strategytool.dev.dotstory.de"
                        }
                      ~ env {
                          ~ name  = "PUBLIC_KC_URL" -> "PUBLIC_KC_CLIENT_ID"
                          ~ value = "https://keycloak.dev.dotstory.de" -> "strategytool"
                        }
                      ~ env {
                          ~ name  = "ROARR_LOG" -> "PUBLIC_KC_REALM"
                          ~ value = "true" -> "knot-dots"
                        }
                      + env {
                          + name  = "PUBLIC_KC_URL"
                          + value = "https://keycloak.dev.dotstory.de"
                        }
                      + env {
                          + name  = "ROARR_LOG"
                          + value = "true"
                        }

                        # (4 unchanged blocks hidden)
                    }

                    # (2 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 2 to change, 2 to destroy.

```

</details>

*Pushed by: @freudenberg, Action: `pull_request`*